#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>
```


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

aws_vpc.vpc_fiap: Refreshing state... [id=vpc-0fee7fca4df8dc99f]
aws_iam_role.cluster: Refreshing state... [id=eks-cluster-role]
aws_iam_role.node: Refreshing state... [id=eks-node-group-role]
aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy: Refreshing state... [id=eks-cluster-role/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
aws_iam_role_policy_attachment.node-AmazonEKSWorkerNodePolicy: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
aws_iam_role_policy_attachment.node-AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
aws_iam_role_policy_attachment.node-AmazonEKS_CNI_Policy: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
aws_internet_gateway.igw: Refreshing state... [id=igw-03472ed8e56ce1e93]
aws_subnet.subnet_public[1]: Refreshing state... [id=subnet-03b5cd06b2afc00eb]
aws_subnet.subnet_public[2]: Refreshing state... [id=subnet-0e2967af54dd1ba14]
aws_subnet.subnet_public[0]: Refreshing state... [id=subnet-0e87a876fe8224bc8]
aws_security_group.sg: Refreshing state... [id=sg-0ad5d2bf8399368b1]
aws_route_table.rt_public: Refreshing state... [id=rtb-02acc5ad81a3bdbfd]
aws_route_table_association.rt_association_0: Refreshing state... [id=rtbassoc-0048bee5cb7ec3dc4]
aws_route_table_association.rt_association_2: Refreshing state... [id=rtbassoc-0f163e0a060850b97]
aws_route_table_association.rt_association_1: Refreshing state... [id=rtbassoc-03b19afdf874675c4]
aws_eks_cluster.cluster: Refreshing state... [id=eks-spoo-ent3-backend]
aws_eks_access_entry.access_entry: Refreshing state... [id=eks-spoo-ent3-backend:arn:aws:iam::579375260812:user/camila]
data.aws_eks_cluster_auth.auth: Reading...
data.aws_eks_cluster.cluster: Reading...
aws_eks_access_policy_association.access_entry_association: Refreshing state... [id=eks-spoo-ent3-backend#arn:aws:iam::579375260812:user/camila#arn:aws:eks::aws:cluster-access-policy/AmazonEKSAdminViewPolicy]
aws_eks_node_group.node: Refreshing state... [id=eks-spoo-ent3-backend:nodeg-spoo-ent3-backend]
data.aws_eks_cluster_auth.auth: Read complete after 0s [id=eks-spoo-ent3-backend]
data.aws_eks_cluster.cluster: Read complete after 0s [id=eks-spoo-ent3-backend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.spoobucket-aula will be created
  + resource "aws_s3_bucket" "spoobucket-aula" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "spoo-ent3-backend"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Production"
          + "Name"        = "tfstate"
          + "School"      = "FIAP"
          + "Year"        = "2025"
        }
      + tags_all                    = {
          + "Environment" = "Production"
          + "Name"        = "tfstate"
          + "School"      = "FIAP"
          + "Year"        = "2025"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @CRASPOO, Action: `pull_request`*